# pandas

In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(np.arange(0,30).reshape(5,6),index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4','C5','C6'])
df

    C1  C2  C3  C4  C5  C6
R1   0   1   2   3   4   5
R2   6   7   8   9  10  11
R3  12  13  14  15  16  17
R4  18  19  20  21  22  23
R5  24  25  26  27  28  29

In [7]:
df.head(3) #tail

    C1  C2  C3  C4  C5  C6
R1   0   1   2   3   4   5
R2   6   7   8   9  10  11
R3  12  13  14  15  16  17

In [13]:
df.loc['R1']
df.iloc[0]

C1    0
C2    1
C3    2
C4    3
C5    4
C6    5
Name: R1, dtype: int32

In [15]:
#slicing
df.iloc[:2,:3]

    C1  C2  C3
R1   0   1   2
R2   6   7   8

In [16]:
#converting into array
df.values

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29]])

In [20]:
df_cd=pd.read_csv("datasets/E-card.csv")
df_cd.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,ECTA.S19A1,2001.03,2462.5,NaN,F,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN
1,ECTA.S19A1,2002.03,17177.2,NaN,F,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN
2,ECTA.S19A1,2003.03,22530.5,NaN,F,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN
3,ECTA.S19A1,2004.03,28005.1,NaN,F,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN
4,ECTA.S19A1,2005.03,30629.6,NaN,F,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN

In [21]:
df_cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19345 entries, 0 to 19344
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  19345 non-null  object
 1   Period            19345 non-null  float64
 2   Data_value        17552 non-null  float64
 3   Suppressed        672 non-null    object
 4   STATUS            19345 non-null  object
 5   UNITS             19345 non-null  object
 6   Magnitude         19345 non-null  int64
 7   Subject           19345 non-null  object
 8   Group             19345 non-null  object
 9   Series_title_1    19345 non-null  object
 10  Series_title_2    19345 non-null  object
 11  Series_title_3    3805 non-null   object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.1+ MB

In [27]:
a=2.4
print("{:.2f}".format(a))

2.40

In [30]:
print("Enter the size of a list :")
sz=int(input())#size of the list
lst=[] # an empty list declaration
for i in range(0,sz):
    num= float(input()) #float input
    lst.append(num) #appending into the list
print(lst)

Enter the size of a list :
2
1.4
2.4
[1.4, 2.4]